comboStressTest.yml
config:
  target: 'http://localhost:1000'
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: 'postImageData.csv'
    fields:
      - 'id'
      - 'user'
      - 'imgUrl'
      - 'descript'
      - 'date'
      - 'cat'
scenarios:
  - flow:
    - loop:
      - post:
          url: '/overview/restaurants/{{ $randomNumber(9000000, 10000000)}}/images'
          json:
            imageId: "{{ id }}"
            userName: "{{ user }}"
            image: "{{ imgUrl }}"
            description: "{{ descript }}"
            posted: "{{ date }}"
            category: "{{ cat }}"
      - get:
          url: '/overview/restaurants/{{ $randomNumber(9000000, 10000000) }}'
      count: 100